package com.sunshine.webproject.mvc.service;

import com.sunshine.webproject.mvc.BaseComponent;

/**
 * 用于添加公共的Service层代码
 * @author: sunshine
 * @date: 2020/3/21 18:56
 */
public class BaseService extends BaseComponent {
    //TODO - JavaDoc methods

    /*--------------------------------------------
    |             C O N S T A N T S             |
    ============================================*/
    
    /*--------------------------------------------
    |                F I E L D S                 |
    ============================================*/
    
    /*--------------------------------------------
    |            C O N S T R U C T S             |
    ============================================*/
    
    /*--------------------------------------------
    |  A C C E S S O R S / M O D I F I E R S    |
    ============================================*/
    
    /*--------------------------------------------
    |               M E T H O D S               |
    ============================================*/
}
